[
  {
    "duration": "6:24 min",
    "video_url": "https://drive.google.com/file/d/1qLOoSObz9-u7H7arJi2G6dscCIrCodQh/preview?usp=share_link",
    "transcript": "Hello everyone. I am the student of shri shivaji science college amravati. Class bsc 3rd year 5th sem. Group m design. Today's my seminar topic is pesticides. So let's get started. We will see here. What is pesticides. The classification benefits of pesticides. And disadvantages of pesticides. First. What is pesticides. Simply. Suicide sir chemical compounds that are used to kill base including. Students insects fun joy and unwanted plants. Pesticides are applied to crops. Weather for after harvest. To protect them during state and transport storage and transport. Now pay classification. Pesticides are classified into main in classes. Depending. On different criteria. But some of the subclass says of pesticides are. Insecticides herbicides fungicides and. Prudent sites. Phosphorus insecticides. These are pesticides which are used to destroy insects. This can be. Two types. Organic origin and inorganic origin. So organic v insecticides. Organic insecticides. Control and manage insects in organic farming. These are stable to light and heat. Examples. Ddt benzene hexachloride. Chloride apple tree. Second. Prospect. Insecticides. It is. Oregano for phosphorus insecticides. Har chemicals. These are very poisonous to insect. Does insecticide destroy harmful as well as useful insects. Example. Mela tune and paratha. Now is organic origin insecticide. Inorganic in stick insect asides are compounds. Data not carbon. They are stable chemicals. Which to not operate and are frequently soluble in water. These insecticides are not used in modern production agriculture. Examples. Flooring compound. In the form of sodium. Calcium and barium. Close silicate. Arsenic compound like. Units of calcium and lead. Mercury mercury chloride. And kilometre act as insecticides. Second one is. Herbicides. Pesticides which are used to restore unwanted b in the crop are called herbicide. Selective herbicides kill specific weights and leave. The desired crop. On ham. Some plant are produced natural herbicides. Herbicides are widely used in agriculture. Kyon herbicides regulate screw thommen of the plants. The act on the cell membrane and. Are effective in control of dicot plants. Examples. 2 4 d. Is synthetic auxin herbicides. And 240. Fungicides. This there are many fun joy. Which are responsible for producing plant diseases. Chemical which destroyed. Sach panja cal fungicides. Example body ears. Which is mixture of fly. You are so for and water. Sanjay can cause serious damage in the agriculture resulting in losses of pil. Quality and profit. Fungicides are used both in agriculture and to fight against fungal infection in animals example. Tea tree oil. Second one. Cinemala aldehyde. Third cinnamon essential oil. Phone jojoba oil. Face neem oil 6 rosemary and milk. Fourth one is. Rodent pic site. Couldn't sites are pest control chemical which are used to kill rodents. Students are usually difficult to kill with poison because their feeding habit are like. Avengers. An effective rodenticides must be tasteless and odourless. Little concentrations and have a delayed effect. Student suicide. Are so dangerous that if given in single sweet pay. The rodent is ke in fore stores only. Now benefits of pesticides. They are used in public health programs. To control the vector borne diseases. They are used to protect stored food grain. The protect the standing crop in the field. Do not increase the crop like fertilizers by protect. The crow from the first. Sunday can be used to control the household pest. Now disadvantages of pesticides. Open are they often clean the non-target species. Pesticide residue on crop. Pesticides and environment affect animal up. Food chain. People working closely with pesticides at risk of health problems. Thank you.",
    "keywords": "pesticides,insecticides,insects,crop,herbicides,organic,plant,fungicides,diseases,chemical,chemicals,weed,pesticides use,rodenticides,agriculture",
    "domain": "Chemistry",
    "title": "Chemistry - Pesticides",
    "faculty": "Kalaam"
  }
]