[
  {
    "duration": "6:12 min",
    "video_url": "https://drive.google.com/file/d/1T2lNWmtfwR3cz_mKY3FpigWHyKMAXeYe/preview?usp=share_link",
    "transcript": "My name is kushboo and i am going to present my seminar presentation on introduction of machine learning. Where is the table of contents introduction types of machine learning and algorithm concept of learning system application of machine learning and conclusion. Introduction of machine learning machine learning is a application of artificial intelligence that provide system the ability to automatically learn and improve from experience without being explicitly programmed machine learning focus on the development of computer programs that can accept data. And here is the vs ml vs deep learning is a subset of ai and artificial intelligence is a trend final output machine which mimic like human brain example of artificial intelligence us amazon alexa and son and machine learning machine learning is a subset of artificial intelligence it is a technique to achieve artificial intelligence example of machine learning is spam detection and deep learning deep learning is a subset of ml and it is a technique to achieve complex example is deep learning is number plate detection. And here are the types of machine learning and algorithm there are three types of machine learning algorithm first is supervised unsupervised and reinforcement learning. Supervised learning based on two parts classification and regression and unsupervised learning based on the clustering and reinforcement learning based on collaborative filtering. Supervised learning supervised learning use classification algorithm and regression techniques to develop predictive models. Classification separate the data and the regression fit the data. Is the algorithm of supervised learning linear regression logistic regression decision tree random forest and naive bayes classifier. Linear equation means linear regression is a machine learning algorithm based on supervised learning. It performs a regression task. And here is the it is most widely used of finding out of the relation between variables and forecasting. And different regression models differ based on the kind of relationship and between dependent and independent variable. Where is the equation y is equals to theta 1 + theta 2 into x. Vitamin is a intercept and theatre to is the coefficient of x. Under. Is a logistic regression so a logistic regression is a supervised learning classification algorithm used to predict the probability of target variable the nature of the target or independent variable is. Which means there would be only two possible classes. It's sim in simple word the dependent variable is binary in nature having data coded. Is either 1 or 0 yes or no. Decision tree for decision tree algorithm fall under the category of supervised learning that can be used for solve both regression and classification problem. And a random forest so random forest it is a assemble techniques capable of performing both regression and classification. Task with the use of multiple decision tree and technique called put staple gowtham. And never be classified naive bayes classifier a collection of classification algorithms based on bias theorem. Supervised learning unsupervised learning is a machine learning technique where you do not need to supervise the model instead you need to allow the model to work on its on the to discover information it mainly deal with the unlabeled data. And algorithms of unsupervised learning here is the important algorithm in unsupervised learning hierarchical clustering came interesting and can understand for clustering is an important concept when it comes and supervised learning it mainly deal with finding the structure of pattern in collection of uncategorised data. The cal clustering algorithm will process your data and find natural clusters. In this graph hair cluster interview and cluster c. Cluster is 11 type and cluster beans another type and process is another type of. Calculating resting is an algorithm which builds a variety of cluster. And kimi clustering payment is it is an iterative clustering algorithm which helps you to find the highest value of every attrition. K nearest neighbours k nearest neighbour is the simplest of all the machine learning classify it differs from other machine learning techniques in that it does not produce a model. Even when there is the distance between example the learning speed is slow when the training set is large and. The distance calculation is non trivial. Reinforcement learning so reinforcement learning is an area of machine learning it is about taking suitable action to maximize river in the particular situation. And reinforcement learning differs from the supervised learning in a way that in supervised learning the training data has the. All answer key with it so the model is trained with the correct answer itself where in enforcement reinforcement learning there is no answer but the reinforcement agent decide what to do perform the task given task. The concept of machine learning system. And in concept of learning in ms system is learning is equals to improving the experience at some task. Where is the improved over task tea and with respect to performance measure ap and visual experience. Application of machine learning face recognition and speech recognition and self driving technologies. And so on and meaning. In conclusion as we move forward in into the digital age our technology continues to lives and. Straight forward this incredible from form of artificial intelligence is already being used in various industries and professions. From marketing to medicine and web security. This technology can improve our life in several numerous way. Thank you.",
    "keywords": "recorder,machine,regression,machine learn,supervise,supervise learn,learn,decision,decision tree,algorithms,unsupervised,unsupervised learn,experience,reinforcement,cluster",
    "domain": "Computer Science",
    "title": "Machine Learning",
    "faculty": "Kohli"
  },
  {
    "duration": "13:34 min",
    "video_url": "https://drive.google.com/file/d/1wseNdVxP-tR3GViRk1aKR91Znou-HJLu/preview?usp=share_link",
    "transcript": "9 chapter 6 going to move to rank retrieval. And. We're going to look at a model for information retrieval that is going to be different from. The boolean retrieval model that we have been considering sofa. The new model that we are one look at is called and retrieval and this is a. A model that. Closer to what. Real world search engines you. Because. In the boolean retrieval model. The semantics of. Abul enquiry was such that. Either document matches the query or doesn't match the query. There was no. Gradation of matching either a document matches the query order doesn't match depending on. Whether or not it satisfies that boolean expression or not. The problem with boolean query was that. The problem with the boolean retrieval model in general. What's that. It's not something that the majority of users would find useful. It was useful for. More sophisticated users. Is example of. Noise and westlaw. You have a precise understanding of their needs. And i can express that precise understanding in the form of boolean query. But we can expect ordinary users. Auto pk table off. Writing such long. And precise boolean queries. The other thing with boolean retrieval is that. It may be good for applications. Which consume the results of a search index. To ab if the results of. Offer query are not going to be consumed by a human but are going to be consumed by an application. This kind of a model may work because i applications can automatically. Pass. Thousands and thousands of reserves. But if you are going to return the search results to. Human user. Then. Problem is that if we have thousands of results. In in your. Apollo query. The users can't be expected to wait through so many results. An aesthetically crew of web search where users don't have that patience to. Look beyond the first no20 documents. And this is my ranking becomes useful because if you are going to be returning. Results that are. Thousands on millions of documents long as we saw for some queries in past lectures. Is very important to be able to rank. Those documents related to the query so that the users can find the most. Relevant documents. All documents that match the query most closely. And the verito. So that you don't have to. Consume so many results we can just look at. Who police the most important results. Suggest to elaborate on a couple of points. One of the problems with boolean search. Is that. Why do you have these houses of results. Aur. You get this other extreme. When you interpret too few results. Siri call how do. How do lawyers at westlaw use boolean queries. The start of the short query. And for very short query you can expect. Results to be. Very large number. Because your creamy not be precise to start with. And then when you get to money results more than what. You can actually pass. You could add some more terms to your query. And. Along get your query to make it. More precise. And that could hopefully cut down the results. The number of results that you are getting. What often happens is that. As you start making your query. Longer and longer. Number of results does decline but. It can often suddenly drops to zero when you along gate queries. For the beyond a certain point. Net per example. User query. Standard user dealings 650. This food. Exam point of few years ago at least this was dealing about 200 2000 hits. Undertaker search engine. Brij vihar displays no card found. It kills 0 hits. 100. The problem with boolean search here is that you either get up east of result for women officers. Kishor koi is too short you make it too many results that you can handle. Insert query is too long then you may get to pure results. And it takes a lot of skill to come up with a precise bully enquiry that will return. Manageable number of it's just enough that you can. Pass through. Keshav. Aur queries in general 10 to give to many results. And long. Conjunctive queries 10 to give you results. So we need some kind of. Trade off. All are we need to make life easier in that. We want to be able to. Match. Query. Match the query with documents even if. Match is not totally precise in case of boolean queries. Other document matches the query or it doesn't matter. What happens in a in an actual search engine is that. Instead of using boolean queries uses type in pretexts queries. It's very uncommon to find. People typing game a bull enquiry on google. Usually devil just type in a set of words. And. This kind of query is called the free textarea because those set of words don't necessarily specify any kind of a boolean operation. For example i could write a. Query like india. Capital. I am intend to. Get information about the capital of india. I can write a free text query like this. And. I need documents talking about the capital of india. But i can express it in this way. Interpreter as a free text query. So. Rather than. This query being in a particular query language. Boolean query language. Where we use terms and then connect them using operators. Where is just one or more words in human language. And. Rather than a particular document exactly. Satisfying this query on not satisfying this query. In ranked retrieval. In inder and retrieval model. Going to. Return. List of documents. Such that the documents at the top. Match the query better than documents. Order below in the list. Sudhar graduation in the quality of the match. It's not like a binary case where a document matches for it doesn't matter. Brother gradation of quality of match. Ism documents may match the query better than other documents and there is a. There is a continuous notion of how good are matches. Pawan can assign score. Given document and say that documents with the highest score match the query better. Night show. Brand factory sale. Has. Normally been associated with free texperia zameen. You can think of free text queries. Being combined with boolean retrieval model instead of boolean queries it so we had. Boolean retrieval model. Mera. Other document matches the query or it doesn't match and that's associated with boolean queries. And typically and retrieval model. The associated with free text queries. I want to see that. This is the kind of modal that is. Employed in. Search engines. Vishva. Is not common to have brand factory velocidad with full enquiries or boolean retrieval associated with free text meaning. This is how things go together. We don't get this feast of famine problem in ranked retrieval. Even if the resultset is very large. Send problem because. Your documents are ranked in decreasing order of. Proximity to the query order elements to the query. And we can always just show. The top 10 result like google does. You don't have to bombay the user with thousands and thousands of results. Under 2 in a scrambled order as an. Boolean retrieval pick and drank the. List of documents for the user doesn't get overwhelmed. And of course assume that we have a good ranking algorithm. So. How do we. Build such a system. We want to return documents. In decreasing order of. Some score. Decreasing order of relevance to the. User. Which we are going to try to quantify as a score. So we're going to order the documents. To rank order the documents with respect to a query. By coming up with some kind of the score. Aur every document. Underscore. Will be in the range of 0 to 100 indicates. Anu match score of 1 indicates. The best quality match. And the score will in general be. Real number between 0 and 1. So highest score would mean that the document is. Closer to the quarry. Satish continuous ko. Is going to measure how well the document enquiry match. Is again an idea of a match in ranked retrieval is not binary. Its continuous. So you can have one document matching a query better than other document. Something that you didn't have in. Golden retriever. Sohar we assign such as ko let's try to think about how we can come up how we can define such a score between a query. And document. So let's start with a simple example where we have. I want enquiry. Insert query is. India. Suppose this query term. Does not occur in the document. Sabir comparing. This query with every single document in the corpus. Looking at one particular document. B a document i. Suppose this query term india does not occur in the document. Can we say that the score should be as you. That is there is no match between the query and the document. Know if the word india occurs. In the document. Then we could look at. How many times it occurs in the document. And the idea is that if it occurs a large number of times in the document. Then the document is more important. Then another document where it may occur only once. The most frequently query term occurs in the document. You're going to make the score higher. How we are going to try to define the score. Kendra number of ways to diff two to come up with such as score. Which satisfy this condition that is when there is no match the the value of the score is 0. And the more number of times the. Query term occurs in the document. The higher the score is.",
    "keywords": "query,retrieval,rank retrieval,users,language,rank,flee,flee query,rank retrieval model,retrieval model,principle,feast,produce,precise,precise understand",
    "domain": "Computer Science",
    "title": "Ranked Retrieval",
    "faculty": "Sharma"
  },
  {
    "duration": "18:48 min",
    "video_url": "https://drive.google.com/file/d/1U44fP9-6fuhxFxkv4MesADoQW-Io05IV/preview?usp=share_link",
    "transcript": "Hello everyone in this video i am going to discuss about cyber security. English video. We're going to discuss these topics. Introduction and definition of cyber security in chetna cyber security. Common terms used in cyber security. There are some types i will discuss. Components of cyber security. What are the career opportunities in cyber security. Specialisations in cybersecurity and finally. Some preventive measures. Ok let's start. What is server security by the way why do we need security. Scenery. People getting connected to internet in a wide range. And there's not getting proper security. Due to lack of 7 minute most of the people are becoming victim to cyber attacks. I don't know they didn't have the knowledge to protect the data. Connected to the internet and sharing what are the files. Open internet. But they don't know how to secure just files. And how to get saved from the attacks. As a result many people becoming victim to cyber crimes. Which is a serious issue because. It's like robbing all the personal data. All the citizens of the country. Latest about formal definition. What does the term cyber actually means is. Is nothing but something related to computers information technology. Then the term cyber security we can simply say it. The security being provided to the devices which are connected online in simple words. It is a service. Itni security service. Which office security to online devices. The devices which are connected to the internet. The main thing is internet. Should get connected to internet. Let's. How look into the history how the cyber security. In the early 90s a person am bob thomas. A one slice that whenever we send a file or something in the internet. It needs to travel through some. Hopsin notes. Across the network. So what you found is where ever the file go. It will have something. It leaves some mark. On the every note it reaches. Using that idea he created a program name creeper. Which prints the message and the paper catch me if you can. On the binu ritviz. Which is. Something like a virus. Normally virus party does whatever wherever it goes. It destroys the system resources or print some messages. Are descriptor also doing the same thing. Wherever it goes network. What are the notes of surprises. At least this message on the paper catch me if you can. Letter a person named ray tomlinson this is the good guy who invented email. Then he design another program cal re per. Which we can also called as 1st antivirus because this program reaper. It says the creeper and destroys it. Ok this is something like in anti-virus reaper. The histry creeper and repair are. Analogous to cyber-attacks. You can even say these are the first cyber attacks. This is a demo creeper. She finally prince the message i am the creeper catch me if you can. New latest see what is the hacker weather. In simple words a person. Breaks into other systems. Without their permission. He doesn't have the authorisation to enter into other systems. But we somehow against administrator control. An intercept of the system. Hacking is completely legal because no one has the right to. Visit other systems without the permission right. So hacking is completely dead. Three types of hackers sofa. This white ha is nothing but. The hacker who performs hacking for the sake of good. Will perform hacking. So that he will come to eat and come to know what are the loopholes present in a system. Which can help him to rectify. Black hat hackers a person. Who performs. With bad intention doesn't have any good intention is completely performs. With the bad intention. Bye. Sometimes of financial sekar sometime. With some revenge. What is grey hat hacker he is not. Neither completely white not black hat hacker. He sometimes behaves as white hat and sometimes he might be black head. Is both here will be having both the properties. What is a malware virus. Mal where is nothing but malicious software in simple words. Which actually means that. This of this software should not be there in our system because. In the name itself malicious software. This software is not healthy for your sister. It can destroy your system resources. It can capture all of personal private information. Medicine to someone else. Usually use this kind of malware so that they can take revenge on the attack on the victim or deccan. Treating him for some financial. Benefits. These are some type from always virus adware rootkits 5 ransomware trojan horse remote access. Mahaveer maugham ki login. Ashtmi knowledge ransomware is the most powerful because. Wannacry ransomware is one of the ransomware which caused a lot of destruction to big companies in the world like sone not this company. They got affected by this i wanna cry ransomware. What happened was all the personal files. Parson files when the customer data also. Attack. Encrypted them and they demanded lot of. Money so that deccan i can decrypt the data. This we can say is due to some security breaches in the. Network. They might not be having proper security mechanisms. Another issue. Based on the intensity of attacks we can classify attacks into two types active and passive attacks. In activator. What happens is that are directly modify the message content. Message is being sent from. Source to destination. Aur ine auraton se sender receiver. Message which is sent from the sender. Will be sent to receiver. Data kareena ke beta please modify the message content. Under receivable come to know that the message content is modified and. In equator. Easy to identify because. They may cause. Light damage to system resources also. System resources means what are the hardware component event and forget them at some time. Button kaise baithe data. Sit silently. Just copy the message contents without altering them. Does a result this attack is. Not that much powerful this is powerful. Not easy to identify. We cannot. Come to know that this attack happened. Under system resources he doesn't damage he just all diseases copies or message content which is also not so accept acceptable. New latest. Please look into types of cyber criminal. Disawar. First type is this. This terminal the just perform. Crimes for the sake of recognition. Just want to get recognise everywhere in the society. Like a set of fun we can say. Cyber criminals and second type. They not interested in condition but the internationally. Offer mein tax. Remind me psychological perverted people and sometimes. Financially supporting actors. Type 3. These people are insider. Which means. Suppose we have an organisation x organisation. And the person who was the ex employee of the organisation. Assam career with that organisation and he international you want to describe the organisation. As we know we will be knowing all the secrets out organisation. Can easily perform better on the torque nation so that email i can damage. This type of criminals are in silence. Within the organisation. Aap briefly we can classify server crimes into. These categories against individual against property against organisation and against society. Nav latest about the components for cyber security. Components in what. What. What aspects. Constituted as a whole. In cyber security. Testing is critical infrastructure infrastructure is nothing but what are the. Components of the hardware components also we have. 2016 will these components will also be having equal importance because. Someone hack server cctv camera. When we do we don't know that the person hack the camera. But he will capture all your data and you can even. He will do whatever he were. Because. He is my dad. That we should also have some. Actions on architect online or infrastructural. Properly maintained. Cloud security. We are now a days everything is being connected to internet. Another thing is getting stored into the cloud. Cloud computing is in demand. So we should have. Security to our cloud also. Because whatever the users will be having your organisation. Delhi using our cloud environment. Don't provide much security. The uses which we have. Get some issues. Internet of things is nothing but. Connecting everything to the internet. What are the hardware components we have in our home also like tv fans. Refrigerator everything. We can remotely control them as we will be having. Connect as will be. Having access to them because that connected to internet we can remotely. Control m. Accepting them on turning them off. Is that i can gain control of this thing then he can even play with us. Network security setting but what are the network we have in our organisation we should protect it by installing some proper firewall. Are taking some. 700 tips. Finally. Whatever the. Organisation it might be. The employees of that organisation should. Should be trained in such a way that. They should not become victim to cybercrime because if the employees get victims. The other organisation will get affected. So the order employees should also have some knowledge on cyber security. These are some career opportunities in the area of cyber security. Security architect. Consultant p********** tester. Security consultant is a person who protects coronavirus and stator. Sanitation tester is nothing but an ethical hacker we can also say. Performs hacking. Find the weaknesses for vulnerabilities in the system which attackers in used to perform data. Chief information security officer is the highest level job position. Among all the career opportunities in cyber security. He can even have his own security measures because he is the superior of all the security officers. Photographer is a person who writes sports that hackers cannot track. Of course the main team of fees that thing. Converting a message. Inter sambandhit double format. Which we call it is encryption. We do that thing by having some key. Which is private between the sender and receiver. The receiver will only. Can only read the message. But decrypting using that private every having. System security analyst security engineer and security architect they seem to be analogous. What they do is they just. Digest. Take care of water vada security system. But the main differences. Accident. Security engineer is the entry level position after that security analyst. And finally cancer security architect. No these are the specialisation areas in cyber security. Satish acharya samsung. Application security cryptography cyber law for mca. Security. Pen testing. Policy management and governance. Risk assessment. Architecture. Application security is nothing but providing security to whatever the application see here. Cryptography is nothing but the process of. Encryption and decryption. Cyber laws is nothing but. Making lost so that attack. Will get punished. Foreign six years after the attack happened what are the steps we should take. So that we can recover from the data under 10 event. Trace the attack. Network security what are the what are the network theory using it should provide proper security to the network. Sanitation testing is nothing but. Ethical hacking. He performs 30 people perform hacking. With the permission of an organisation and. Will identify voter whatever the loopholes present in the coordination. Policy management. W for any organisation they will be having some cyber security policy. So that they should not become victim to cyber crime. Ss vintage. Assessing the risk. Judging the raised water to place of the cyber security. Security architecture. I think we will discuss in a slide. Vishal things. Finally deserve these are some common attacks malviya we discussed. Fishing man in the middle denial-of-service. Sql injection. Zeroed exploit cross 6:15. Elicited vecancy. The cosmic destruction. We should. Stay away from this exam in which should get protected. Odisha tax. Finally i would like to share some preventive measure common preventive measures. I should have strong password is consist of. 8 characters minimum of 8 characters. Capital letter. Murder case. Amit small letters numbers. As illustration character. Securing a computer by installing proper antivirus software. Shouldn't we can i install anti spyware software. Then that they can block spyware attack. Amenities fibre software. In social media we should take preventive measures like for example what are the what are the social media we have instagram and facebook. Providing their own security measure. Like. New step authorisation. 2 standard things you better enable them so that we can get saved from this attack. We should secure mobile devices by having strong passwords. Not. Bi install. Should not install any suspicious applications on server. It protect our data. Why not sharing order the first information we have. Weather. Wireless network what are the wi-fi network or a thing we have you should have strong password. So that we can secure network. Living product overy identity. I mean we should not get expose watch online. Because. Juta online activity also detector may come to know. Password 7. Finally we should avoid being scam. For example. Should not open any suspicious or malicious. Links which we get message. Mobile messages. You should. Have some ever so that we can get saved from my listing. Finally thank you.",
    "keywords": "security,cyber,cyber security,hackers,attack,specialization,malware,hacker,keeper,measure,software,damage,cybercriminals,engineer,cybercrime",
    "domain": "Computer Science",
    "title": "Cyber Security",
    "faculty": "Chopra"
  }
]