[
  {
    "duration": "9:06 min",
    "video_url": "https://drive.google.com/file/d/16UruczqCh_OwXB4CgBhz8r2Vo-cZPq3V/preview?usp=share_link",
    "transcript": "Hello everyone i am kiran joshi hope you all are fit and fine. Inner journey of physical divisions of india let's learn about the coastal plains and islands of india. This video. Look at the map in front of you. You will notice to strips of plains along the east and west coast of india. These are the coastal plains of india. Children a coast is the area or the land where it meets the sea or the ocean. You can also see that a ghost is a line that makes the boundary between the land and the sea or the ocean. So children our country has a long and beautiful coastline which extends for about 7,000 km from rann of kutch in the west. West bengal in the east. It means it stretches all around the indian peninsula. The coastal plains are broadly divided into the western coastal plains and the eastern coastal plains. So let's begin with the western coastal plains. The western coastal plains are located between the western ghats and the arabian sea. The western coastal plain is long and narrow. As shown in the image also. The western coastal plains have many small girls and bays. Girls and bays are the different types of water bodies. These girls and base on the western coast provide many natural harbours. Harbour is an area of the sea along the coast which is deep enough and partly and closed by the land so that the ships of the boats can be left there safely. Some famous natural harbours in the western coastal plains are mumbai in maharashtra vasco in goa and kochi in kerala. Also there are several ports on the western coastal plains. A port is a town or a city that develops around a harbour where ships load and unload their cargo and passengers. The western coastal plains can be divided into three parts. Gujarat coast. Konkan coast and the malabar coast. The northernmost part of the western coastal plains is the gujarat coast. If you look closely to the given image you will see children. That it is. Broadest between the gulf of kutch and the gulf of khambhat. As i said earlier that a girl is a type of water body. To make the term more clear to you i can see that a girl is a large area of sea or ocean water which is partly surrounded by land. To the south of the gujarat coast lies in the konkan coast. Konkan coast is stretched up to goa. Kumkum cost is. Quite narrow rocky and uneven. Therefore we find many lighthouses across the coast to warn the ships so that they may remain away from the rocks that lie just beneath the surface of the sea. You will be curious to know. The meaning of the term lighthouse so children look at the image in front of you. It is the image of a lighthouse. A lighthouse is a town or visit our autol building. With the powerful light on or near the sea to guide ships away from the danger. The konkan coast is rich in oil resources. And many oil wells such as bombay high court found here. 22 further south lies the malabar coast. The coastline here has an even edges. Malabar coast is known for its numerous lagoons or backwaters. Children a lagoon is a lake of salt water which gets separated from the sea by barrier islands or leaves. Now let's learn about the eastern coastal plains. The children the eastern coastal plains are located between the bay of bengal and the eastern ghats. The extent from ganga delta in the west bengal to kanyakumari in tamil nadu. The eastern coastal plains are comparatively broader than the western coastal plains. There are a number of southern rivers such as mahanadi godavari krishna and kaveri. That flow eastwards and fall into the bay of bengal. These rivers form deltas along the eastern coastal line. The learnt here is very fertile. Because of the mineral rich soil brought by these rivers. And a lot of rice is grown in this area. So just plane is also known as the rice bowl of india. The eastern coastal plains of india. Have many ports among which. Chennai and visakhapatnam aro. Great importance. The eastern coastal plains can be further divided into two parts the northern part is of the eastern coastal plain is called the northern circars and the southern part is called the coromandel coast. The eastern coastal plain and the western coastal plain meet at kanyakumari in tamil nadu. Kanyakumari is the southernmost point of the mainland of india. Another important fact about kanyakumari is. That at this place the three water bodies around india. The indian ocean the arabian sea and the bay of bengal meet. Two children. Sofa in this video we have learnt about the coastal plains of india. Now let's try to understand. Aur learn about the island groups of india. First of all let's understand the meaning of island. So and i let is a small piece of land. That is surrounded by water from all around such as a lake. River or sea. India has 2 island groups on both sides of the indian peninsula. These are the andaman and nicobar islands located in the bay of bengal and the lakshadweep island situated in the arabian sea. Andaman and nicobar islands. Lie in bay of bengal. Dr rafli 572 islands. Out of which. Only 38 islands are inhabited. A large part of the population consists of tribal groups. Port blair is the capital of andaman and nicobar islands. The famous cellular jail is also in andaman and nicobar islands. Andaman and nicobar islands are mostly hilly islands and are covered with forest. The lakshadweep islands lie in the arabian sea consisting of 36 islands. However only 11 islands are inhabited. Kavaratti is the capital of lakshadweep islands. The lakshadweep islands are generally flat these islands are well known for their coral deposits. You might be thinking of wondering what are corals so children corals are tiny sea creatures. With a hard body covering. Now let's learn about the importance of the indian coastal place and the island group. Several big and small ports are there along the coastal areas. D sports play an important role in the growth of natural a national and international trade. Then there are several harbours also. Then many coastal towns and cities are great attraction for tourists. Fishing is an is one of the important occupations for many people here. Many different types of crops are grown in this region for example rice coconut rubber et cetera. The island groups of india are very popular and attractive tourist spots. If we talk about the climate. This region has moderate climate. Because this region is quite close to the sea during the day it is warm and humid. How about the nights are mostly cool. The reason behind it is that at night the sea breeze blows. Towards the land from the sea. That's all for this chapter. Hope you found this video helpful. And if you like this video. Do remember to share and subscribe to the channel. Thank you.",
    "keywords": "coastal,coastal plain,plain,islandscoast,eastern,western,india,eastern coastal,western coastal,western coastal plain,water,coastline,eastern coastal plain,gulf",
    "domain": "Geography",
    "title": "Geography - Coastal plains and Islands",
    "faculty": "Singh"
  },
  {
    "duration": "16:51 min",
    "video_url": "https://drive.google.com/file/d/1qLOoSObz9-u7H7arJi2G6dscCIrCodQh/preview?usp=share_link",
    "transcript": "Hope you are fine. Michael super welcome to the geography chapter agriculture for class 8. Food mood. To understand about the various kinds of. When we can find economic activity there are three major. Primary secondary inter. Primary amine. We are using the product which comes from neet. Hunting gathering. Example. Aadhaar. Nature. Secondary active. It will be difficult in the later chapter. Looking for skin primer. What is sericulture. Medical treatment of rock and domestication of animals. Play a significant role in our mind. Cultivation of crop one of the select sorry. Workonic. Law of the land. Chaudhari. Provide water to the free. Look up the growth of plant and find and harvest. Sperm is 13. Hindi film agriculture human being. Letter try to understand the term. Letter to writing word that. Jigar + culture. Culture means cutting. Today more than total world population are depend on agriculture. Why. India population engaged in agriculture. Direct directory in education. Simple frock. Blouse. Which light show. Examples of agricultural activities. Sunflower oil from and earring. Let's discuss about the components of agriculture sector. So. It is the times of cultivation on the soil raising crops. Second one. Horticulture. The art of going with flowers. Fruits for commercial use. Sericulture. Science of commercial rearing of silkworm. 481. The art of breeding of fish in sanskrit. Viticulture. It is the art of. Cultivation of grapes. 9 letters understand what are the factors influencing agricultural activities. Effective. Vaswani metrocast. Other one man made. It's about metro factory. Diya. Water and. Understand. The first national factories release. What is relief. Control in agricultural activities. And lowlands are motu table for agriculture. Complaint. This is because in the india. Left for time in the problem of soil erosion is high. On the contrary that problem are absent in the plant area. We provide. Best conditioner for agriculture. Most of the early civilization and clean area. The second one is drawing. City of music and ganpati. What is the basis of any form of agriculture. What is the meaning of moisture and food for decline. Acceptable only for the growth of varieties of crop. I do not support the growth of plant. What. What are you official for the growth of plant for example. Provide food crop production as compared to those who live in the gradation prosperity. Plant that. The british control or the arable land of the world. The land on which. The crops are grown is known as. Temperature in false not given for the farming activity. Now we will moon to magnet. Machine. In the farming activity. Song. Both the chemical to get more production in the farm. Use of fertilizers and charm of soil and also their production. Agricultural activities. Public importance board ceiling. Video of labour force save from and. Market and transport. Transport for the movement of agriculture product from agriculture field. To market. Market production by the farm. Now you're going to be. System. Output control. Sofa vineet. Machinery and labour. Let me what we do with input how we use it. Slogan. Show me reading. What we give from the applet. Dairy product. Wallpaper. Not the most important topic of the chapter types of farming. Category. Satnam swami ki commission. Show me the picture. We are not using for our own purpose. But. For how to write purpose. Meet the need. Abhi pharma sanam. By using low level of technology and houses. The needs of the car. What are the features of. The sun. Production consumer id form. Variety of crops are grown by the farmer. The use low level of technology multi and household table. Production is relatively low and the farmers originally. Are you fine. 10 lakh in surface production. Primitive. Song. Intensive cultivation. Small plot of land. Simple and treatment tools are used in agriculture. Number of labourers. Small plot of land provide only one crop anjali. Only manthan region of india. Shifting cultivation examples. Discuss about shifting cultivation is also known as slash and burn agriculture. Cutting burning. Then that is of the boundary of the mix with the soil. Different types of crops are grown. But when did it the form of another. Education ameen. Potato name. Crops grown under 15 cultivation. Done by the tribal people living in the tropical forest. Forested areas of amazon basin tropical africa. 514 southeast asia aadami ingredients ravishing cultivation extract. Nomadic herding for livestock farming. Different culture operation. Hindi story hot man moved from one place to another with this animal. Did you show in search of water in for the pending. Folder definition. Goat camel adhiniyam in the human body. To get wool. I need another. Jammu and kashmir and in parts of central asia. Commercial farming. And don't forget to send. Market. About the features of the commercial form. Can be intensive or extensive agriculture. More profit is the main motive of the communication it is done on use plot of land. Modern techniques and tools are used in the farm. Both sides of abdomen in commercial form. About commercial farming. Which is factors on the large farm reading over hundreds of. 4000. Magic quality and modern techniques are used in. Type of farming. The crops are grown for selling purpose. Effective in the temperate grasslands of asia europe and north america. Mi. The second type. Funny life of along with the farming of food and fodder crop. Both activities are practiced on the same formula. Hindustani table. Alpha. Arjun animal. The diary animals and poetry. App to get milk and milk products and meat. The ages of the farmers to maintain a high standard of living. The animal. Also help to maintain the fertility of the soil by providing a natural manual. Which type of farming is practised in south africa south east australia europe. Usa. Plantation crop of burger king ki copy banana cotton rubber. Aur kaisi drone. Plant compressor crop top industries and then translated in water. Jyada non veg. Captain america shield wallpaper. In the form. Nearby. Plant efficient and synthetic methods of farming are used in. Culture. Mere dialogue transport network is very special. Plantation agriculture with more mostly practice in the tropical and subtropical areas of the world. Common india. Sri lanka malaysia. Brazil. Remove the last section of the chapter agriculture in indian and other name. Morning shift be taken to achieve this. Man used to obtain higher. Chemical fertilizers and pesticides. City of the digits of a drag area and the number of crop. Drone should be in two should be improved. Modern tools of agriculture should be used to get more production and profit. Food security. Is the condition of the street in which all people at all times have access to sufficient space hygienic food to meet the drive me. Different country have different levels of agriculture development. Countries like usa canada australia platform. Which countries are you in advance in modern techniques in agriculture electric. Population and small farm tractors in agriculture of the family are we can keep that both the developing and developed country have to front. Aaj tak ka parichay. Nothing but the following steps should be taken in order to meet the demand of our growing population. Children. Please do the working. Thank you.",
    "keywords": "agriculture,farm,subsistence,activities,cultivation,crop,increase,commercial,subsistence farm,primary,commercial farm,labour,intensive,activity,rear",
    "domain": "Geography",
    "title": "Agriculture",
    "faculty": "Sharma"
  },
  {
    "duration": "15:27 min",
    "video_url": "https://drive.google.com/file/d/1Jc3exDU1da0fAoAkEu3ZgofJWqdn04xe/preview?usp=share_link",
    "transcript": "Hello everyone. I am kiran joshi. Hope you all are safe and sound. Welcome to class 6 geography chapter 8. India. Climate vegetation and wildlife. Is it is clear from the title of the chapter that we are going to learn about the climate of india its vegetation and wildlife in this chapter. Let's begin with the climate of india. But before that let's understand the various terms used in this connection. I am hurt. And used the word weather quite often. Children weather is the daily state in the atmosphere. It includes day to day changes in temperature rainfall and sunshine it sector. The weather could be hotter and hotter cold cloud your windy sunny aur vate. When certain fixed weather patterns continue over a few weeks or months. They are called season. India experiences for mains major seasons in a year that follow each other in a cycle. The first one the cold weather season or the winter season. Extends from december to february. Then the hot weather season or the summer season. Extends from. March to me. Then the southwestern monsoon season or the rainy season or the advancing monsoon season extends from june to september. In the fourth season is the season of retreating monsoon or the autumn season extends from october and november. As i said the first season is the cold weather season or the winter season. It falls between the months of december and february. During the winter season sun rays do not fall directly in the region. Winter is more severe in north india where the temperature drops very low the coastal areas experience winter. After the winter season comes the summer season which extends from march to me. In the season the sun rays. Fall the sun's rays falls rays fall direct vertically in the region. Causing a short increase in temperature. Strong hot and dry winds called loo blow during the day in the northern plains and north western part of india. Next in the cycle is the southwest monsoon season that lasts from june to september. The moisture laden winds of southwest monsoon enter india from the arabian sea and the bay of bengal. As you can see from the map also. The. The onset of southwest monsoon occurs each year around the first week of june the monsoon for the advances to the north and by 15 july the entire country comes under the spell of monsoon. Then comes the season of retreating monsoon. Aur autumn. By the. Early october the monsoon starts withdrawing or retreating from north india. The retreating monsoon season is spread over october and november. As you can see. From the map. The retreating monsoon brings heavy rainfall to tamilnadu and parts of andhra pradesh karnataka and kerala. This was the explanation of the four main seasons of india. However the term climate means the average weather condition of a place measured over many years. India is said to have a tropical monsoon type of climate. The term monsoon is derived from the arabic word mausim meaning season. India is located in the tropical region as you can see in the map at the back. Therefore most of the rain that india receives is brought by monsoon winds. India is an agricultural land as we all know and indian agriculture depends upon the monsoon good monsoon means adequate rate and a good crop. There are various factors that affect the climate of a place. Such as the location of the place altitude. Distance from the sea and relief. Is india is a vast land that stretches from the himalayas to the indian ocean therefore india has a wide range of climatic conditions that different addition. For example jaisalmer and bikaner in the desert of rajasthan. Are very hot. Drugs and kargil and leh ladakh are extremely cold and mumbai and kolkata or any coastal area have moderate climate. Mawsynram in meghalaya is the words. Highest rainfall receiving place while it is quite possible that in a particular year jaisalmer and rajasthan mein receive no rain at all. No from the little letters move our attention towards the natural vegetation of india. You might have seen and may be sometimes grown also a variety of plant life such as grass shrubs bushes trees at 17. When the plant life grows on its own in an area without any human interference or efforts it is called natural vegetation. Natural vegetation is also called flora of a region. Natural vegetation varies with relief and climate it means the natural vegetation found on mountains is different. From that found on the plains and the plants found in the desert very from those. Found in wet and humid places. India has a variety of climatic conditions a large range of natural vegetation is found here. Which can be divided into five types. Tropical rainforest. Tropical deciduous forest. Thorny bushes mountain vegetation. And mangrove forest. Tropical rain forests are found in the regions which are warm and receive heavy rainfall. These forests with. Several metre tall trees are so dense. That very little sun sunlight reaches the ground. These forests have different species of trees that shed their leaves at different periods of the year. Therefore. This forest always appear to be. Green. This is the reason that they are also called evergreen forest. The major species found in these forests are ebony mahogany rosewood sincona and jamun. In india the rain forests are found in the western slopes of western ghats. Assam meghalaya west bengal odisha and the andaman and nicobar islands. Tropical deciduous forest. Which are also called monsoon forests are found in a large part of india. The trees in these forests are usually not as close together as in the tropical rainforest. They have a definite leaf shedding period also. From six to eight weeks in a year. Major trees of deciduous forests are. Sal. Sheesham. Sandalwood people and name these forests are found in madhya pradesh chhattisgarh jharkhand bihar odisha uttar pradesh tamil nadu and maharashtra. The third type of vegetation found in india is the thorny bushes that occur in dry regions of the country. They are also referred to as desert vegetation. The needle like leaves and some plants have leaves in the form of spines. And that is to prevent loss of water. Major species of trees found in these forests are kept uses. Hair ki qubool by date palm and half. Deer found in the states of rajasthan gujarat. Punjab haryana parts of madhya pradesh eastern slopes of western ghats and central rocky regions of the deccan plateau. The fourth type of vegetation is the mountain forest. They consist of different types of vegetation depending on the altitude. As the altitude increases temperature goes down. In the high reaches between 1500 metres and 2500 we find coniferous forest the trees. Conical in shape. Important trees found in these forests include cicd in silver for devda and spruces. Now the fifth type of vegetation that is mangrove forest. They can survive in saline or salty water. They are found mainly in the sundarbans in west bengal. Pichavaram in tamil nadu near chilka in odisha and in the andaman and nicobar islands. The sundari tree is a common species of mangrove forests and sundarbans are named after this sundari tree only. Now let's find out. The significance of forest. Forest perform various functions. Day in hell carbon dioxide that we at sale and in return release or oxygen the life-giving gas. Then their roots hold the soil formly together and prevent soil erosion. They provide produce products like. Timber for furniture fuel wood for the leg gum honey fruits medicinal plants and herbs at 17. Forest provide natural habitats for wildlife. The enable percolation of water into the ground. But children. A large part of natural vegetation has been destroyed due to the deforestation. There is an urgent need. To check deforestation. So more and more trees should be planted and the existing ones should be protected. It's high time. For the people to be aware of the importance of trees. Programs like van mahotsav can be very helpful in this direction. As mentioned earlier that forest are natural home for a variety of wildlife. Wildlife refers to all those animals that have not been tamed or domesticated by. Wildlife is also called fauna. Our country has a rich and varied wildlife. That includes a large variety of mammals reptiles amphibians birds worms and insect. Tiger national animal is found in different parts of our country. Mainly in the wildlife reserve. Set up by the government. Asiatic lions are found in the gir forest of gujarat. The only remaining habitat of this majestic animal. The elephants the elephant is found in the forests of gujarat assam. Kerala karnataka tamil nadu and west bengal. One horned rhinoceros are found in the kaziranga national park of assam. Camels are found mainly in the great indian desert. Wild assess drill in the marshy rann of kutch of gujarat. Wild goats. No leopard. Bear true at 17 are found in the himalayan region. Other than these many other animals are there such as monkey wolf jack all leopard wild board. Chital blackbuck. Spotted deer nilgai at sacrum. India is also rich in bird life. Peacock india's national bird is our pride. The other birds found in india include. Parrots pigeons mena giese ducks hornbills bulbuls cranes herons at 17. The government has set up many bird sanctuaries. 2 pro provide the birds their natural habitat and to. Give protection from hunters. Among them bharatpur bird sanctuary which is now known as. Keval radio. National park is considered the largest in asia. Several varieties of snakes are also found in india. For example cobras. Create swipers at 17. Deforestation on a large scale has affected our wildlife directly. Hunting is responsible for many species of wildlife to be on the verge of extinction at a large number of animals are already extinct. To protect our wildlife the government has created a number of national parks wildlife sanctuaries and biosphere reserves. The government has also initiated many animal specific projects to prevent them from becoming extinct. Suggest. Project tiger launched in 1973 and project elephant launched in 1992. No how can the common mass contribute in conserving wildlife. Children you must be knowing that several parts of the bodies of animals are used to make different things. So we can do our bit to conserve wildlife by refusing to purchase such things. Murga the first week of october is observed as wildlife week every year in order to develop awareness about protecting the natural habitats of the animal kingdom. That's all for the chapter. Now there are some questions for you to revise the topic. First question explain different types of seasons found in india. Second question mention different types of vegetation found in india. How are forests important for us. 4th question what should we do to conserve wildlife. If you found this video helpful and wish to watch more of such content do consider subscribing to the channel. And also if you have any queries or questions. Please write in the comment section below thank you.",
    "keywords": "india,vegetation,wildlife,natural,forest,season,different,climate,monsoon,hot,animals,different type,species,bird,weather",
    "domain": "Geography",
    "title": "India - climate,vegetation and wildlife",
    "faculty": "Sharma"
  },
  {
    "duration": "8:40 min",
    "video_url": "https://drive.google.com/file/d/197mC0tulj0DMpEXbBlM9rVWqWGnHRGFJ/preview?usp=share_link",
    "transcript": "Hello everyone. I am kiran joshi. Hope you all are safe and sound. Welcome to class 6 geography chapter 2. Blue latitude and longitudes. Look at the image in front of your children. I am sure you'll you all will be familiar with the name of this image. Yes it is a globe a miniature form of the earth. A globe is a three dimensional or you can say true model of the earth because it gives a better idea about the earth. It provides us the correct shape and size of the continents and countries. It also shows the distances and directions without distortion. Globes are available in different sizes and types such as big small and inflatable pocket globes. Now the question arises. How to locate a place on the globe. Children we need some points of reference and lines to find out the location of places. Now. What are these things. Children look at the image of globe in front of you once again. You will see a needle fixed through it in a tilted manner. It is called its axis. Axis is an imaginary line. And the earth spins around this axis. Do you ever wonder why the globe is shown in a tilted manner. It is to show that in real the earth is tilted at an angle of 23 and half degree to the vertical. I am sure you will understand it better with this image. Now look at the two endpoints of the axis. These are the north pole and the south pole. Our earth moves around its axis from. West to east. As the axis is an imaginary line. Imaginary line that run around the globe is equator. As it is visible here children the equator divides the earth into two equal halves the northern half is called an other hemisphere and the southern half is called the southern hemisphere. This imaginary circular line which is called equator is an important reference point to locate places on the globe. Payal circles. From equator up to the poles post means north pole and south pole. Two parallel circles up to equator. Are known as parallels of latitudes of lines of latitude. They are measured in degrees. The equator is the 0 degree latitude. As we know that it is a it divides the earth into 2 into the northern and southern hemisphere. Therefore all the parallels to the north of the equator are termed as north latitude. And all the parallels to the south of the equator are termed as south latitude. The letters in and as are used to indicate the north and south. Latitude respectively. The north pole is measured as 90 degree north latitude. And the and 90 degrees south latitude mark is marked as the south pole. If you look at the figure in front of you once again children you will notice that the equator is the longest parallel. And as we move away from the equator to the poles the size of the parallels of latitude decreases. The north pole that is the 90 degree north latitude and the south pole that is the 90 degrees south latitude. 8 just dots. Now let's learn about the important parallels of latitudes. So far we have learnt about three important latitude. Bihar the equator 0 degree latitude the north pole 90 degree north latitude and the south pole 90 degrees south latitude. Besides these there are 4 other important parallels of latitude. Among which. To lie in the northern hemisphere. Dr the tropic of cancer at an angular distance of 23 and half degree north from the equator. At the arctic circle at an angular distance of 66 and half degree north from the equator. The other two parallels of latitude are in the southern hemisphere. They are the tropic of capricorn at an angular distance of 23 and half degree south from the equator. The antarctic circle at an angular distance of 66 and half degree south from the equator. Children overall there are 181 degrees of latitude. 90 in the northern hemisphere 90 in the southern hemisphere and the equator. This parallels of latitude help us to differentiate the temperature zones are the heat zones of the earth. Children you know that the earth is tilted on its axis. Due to the sitting at the surface of the earth receives an equal heat or solar energy. On the basis of the amount of heat on solar energy received. We can say that the earth has three heat zones or temperature zones. Diya the torrid zone the temperate zone and the frigid zone. Let learn about the torrid zone first. Children the mid day sun shines overhead at least once a year on all the latitude that are located between the tropic of cancer and the tropic of capricorn. This area is shown in red colour in the image in front of you. Therefore all these latitudes get the direct rays of the sun. Meeting this zone the hottest zone. This one is named as torrid zone or tropical zone. Do you know children that most of southern india falls into the torrid zone. Children dress no latitude beyond the tropic that gets direct rays of the sun. Now the latitude that lie between the tropic of cancer and the arctic circle in the northern hemisphere and those that lie between the tropic of capricorn and the antarctic circle in the southern hemisphere get the incline rays of the sun. These areas are shown in this image in green colour. These areas have moderate heat or moderate temperature. They are called temperate zones. The angle of the sun's rays goes on decreasing towards the poles. Pause me the north pole and south pole. Dell latitude between the arctic circle and the north pole in the northern hemisphere and the latitudes between the antarctic circle and the south pole in the southern hemisphere receives very little heat of the sun. This area is shown in blue colour in this image. The sun's rays are always slanting in these areas making these regions extremely cold. Therefore these areas are called frigid zone or polar regions. Now to find out how much you have learnt so far in this video just try to answer the following questions. Question 1. Define a globe. How is it useful. Define these. Latitude. Longitude. Third question name the important latitudes with their latitudinal value. 4th question. Write short note on different heat zones. So children. That's all for this video. To understand the remaining part of the chapter remember to watch the second video of this chapter. Thank you.",
    "keywords": "pole,latitudes,equator,circle,hemisphere,south,south pole,earth,zone,heat,latitude,heat zone,north pole,globe,north",
    "domain": "Geography",
    "title": "Globe - Latitudes and Longitudes",
    "faculty": "Sharma"
  },
  {
    "duration": "17:12 min",
    "video_url": "https://drive.google.com/file/d/1-2mFuQM3UQSBxfWUkNungJJ7gAaew7Tu/preview?usp=share_link",
    "transcript": "Hello everyone i am kiran joshi. Hope you all are safe and sound. Here i am presenting the first video of class 8 geography chapter 3 mineral and power resources. First of all. We should know what is a mineral. So its definition is. A mineral is a naturally occurring. That has a definite chemical composition. It means. Minerals occur naturally and are not made by humans. They are solid substances. Which are made of one or more elements combined together. Minerals are unevenly distributed on the earth. They are concentrated in a particular area or rock formation. There are some minerals which are found in such places which are difficult to access. For example the arctic ocean bed and antarctica. Children in such. Inaccessible places the extraction of minerals becomes. Very expensive or technically difficult. Therefore becomes an profitable. Definition of minerals we have already learnt. That minerals are formed naturally without any human interference. They are formed in various geological environment under different conditions. Do frocks. Which contain enough minerals so that mining dam is economically suitable are known as coarse. Minerals are identified through their physical properties. Such as colour density hardness. And chemical properties such as solubility. Children there are nearly 3000 different minerals. These minerals. On the basis of composition are classified mainly as metallic and nonmetallic minerals. Metallic minerals can further be classified as ferrous and non ferrous minerals and non metallic minerals may be organic and inorganic minerals. Metallic minerals contain metals in raw form. Now what are metals. Suchandan metals are hard. That conduct heat and electricity. Metals have a characteristic luster. Aur shine. Iron ore. Copper manganese are some examples of metallic minerals. As i said earlier metallic minerals may be ferrous or nonferrous. Dose metallic minerals. That contain iron ore called ferrous minerals for example iron ore manganese chromite at 17. Non ferrous minerals are those metallic minerals which do not contain iron but. They may contain some other metals. For example gold silver copper these are the examples of non ferrous minerals. This was about the metallic minerals now the non metallic minerals as the name itself explains do not contain metals. Some examples of non metallic minerals are. Limestone mica gypsum and mineral fuels like coal petroleum et cetera. Now the non-metallic minerals are either organic or inorganic by origin. Non metallic minerals that contain carbon are. Organic myntra. For example. Coal natural gas petroleum. Why inorganic minerals do not contain carbon. Such as mica limestone graphite. No the question is how are the minerals extracted. Extraction of minerals can be done by mining drilling or query. Mining can be open cast mining or shaft mining. First let's understand what is mining. So my name is the process of taking out minerals from rocks. Buried under under the earth surface. Mining can be open cast mining and shaft mining as i said earlier. When the minerals that lie at shallow depths are extracted by removing the surface layer it is called open cast mining. And to reach mineral deposits. That lie deep below the earth's surface deboss called shafts are to be made this is known as shaft mining. Is petroleum and natural gas occur for below the surface of the earth. So to take them out deep wells are bored. It is called drilling. Drilling is also done offshore. When the minerals that lie near the surface are simply dug out. The process is called query. No let's see the distribution of minerals over the earth. Min minerals occur in different types of rock. Such as. Igneous rocks metamorphic rocks and sedimentary rocks. Mostly metallic minerals are found in igneous or metamorphic rocks. Which mate large plateau. Iron ore in the chota nagpur plateau in india iron ore in north sweden copper and nickel deposits in ontario canada. An iron ore nickel platinum and chromite in south africa these are some examples of minerals found both in igneous and metamorphic rocks. No sedimentary rocks. Which are formed along the plains and young fold mountains have. Deposits of non metallic minerals. Which may be organic or inorganic in origin. Limestone deposits in the pocket-size mountain in france. Magnus deposits in ukraine and georgia georgia. And the phosphate belts of algeria are some example. Of non metallic minerals. Mineral fuels like coal and petroleum are also found in between layers of sedimentary rocks. No let's see the distribution of minerals in different continents. Let's begin with asia. In asia which iron ore deposits are found in china and india. Asia produces more than 50% of the world's tin. China malaysia and indonesia are included among the world's leading producers of tin. China leads in production of lead. Antimony and tungsten. Saudi arabia. Iran iraq kuwait. They have world's largest reserves of petroleum and natural gas. The continent that means the asia continent also has large deposits of magnesium bauxite nickel zinc and copper. No ip talk about europe. So europe is one of the leading producers of iron ore in the world. Russia ukraine sweden and france. These are the european countries which have large deposits of iron ore. In eastern europe and eastern russia copper lead zinc. Magnesium and nickel are found. The root value of germany is rich in coal deposits. No let's find which minerals are found in north america. In north america there are three major zones where mineral deposits are found. Dr the canadian region north of the great lakes. The appalachian region and the mountain ranges of the west. In the canadian shield region iron ore nickel gold uranium and copper are mined. Rich coal deposits are found in the appalachian region. Western toddler car dealers have vast deposits of copper lead zinc. Gold and silver. No in south america. In south america brazil is the largest producer of high grade iron ore in the world. Chile and peru are leading producers of copper. Brazil and bolivia are among the world's largest producers of. Large posits of gold silver zinc. Chromium. Magnesium bauxite mica platinum. Asbestos and diamond. Are also found in south america. Mexico. Venezuela. Argentina chile peru and colombia these countries are rich in mineral oil. Next continent is africa this continent is rich in mineral resources. Africa is the world's largest producer of the. Precious minerals like diamond gold silver and platinum. A fairly large part of the world's gold is produced by south africa. Z. Ent zimbabwe. Some of the other minerals found in africa copper iron ore. Chromium uranium cobalt and bauxite. Oil is also found in sorry oil is found in nigeria libya and angola. Then comes australia continent which is one of the largest exporters. Of minerals. For example. It is the world's leader in the production of bauxite. Iron ore. Call gold. Diamond tin and nickel. Australia is also quite rich. In magnesium copper lead and zinc. Cal guru sorry and. School garden areas of western australia. Have the largest deposits of gold. If we talk about antarctica so children. Geologists and geography was have identified the existence of a variety of minerals deposits. Among which. Some may be quite large. It is a it is forecasted that large deposits of coal in the trans antarctic mountains. And deposits of iron ore near the prince charles mountains. Of east antarctica may be found. Even gold silver and oil are present there in commercial amount. However children mining for commercial reasons. Is ben dear. Only researchers continue to do some mining here in order to find answers to their scientific queries. This was about the. Continent wise distribution of minerals. Now. Let's see the distribution of different minerals in india. Let's begin with iron. In india deposits of high grade iron ore are found. The mineral is found mainly in jharkhand odisha chhattisgarh madhya pradesh. There are also considerable deposits of iron ore in goa maharashtra and karnataka in south. Now the box the another mineral bauxite. The bauxite is the ore of the metal aluminium. In india odisha is the largest producer of bauxite. Other bauxite producing areas are jharkhand chhattisgarh madhya pradesh gujarat maharashtra and tamilnadu. India is the largest producer and exporter of mica in the world. Its deposits mainly occur in jharkhand bihar andhra pradesh and rajasthan. Another major mineral found in india is copper mainly produced in rajasthan madhya pradesh jharkhand karnataka and andhra pradesh. Magnus. Magnesium which is a ferrous mineral is mainly found in maharashtra madhya pradesh chhattisgarh odisha. Karnataka and telangana. Major limestone producing states in india include bihar jharkhand odisha madhya pradesh. Chhattisgarh rajasthan gujarat and tamilnadu. Now the another mineral is gold in india kolar in karnataka have the largest deposits of gold. This gold mines are very deep. In fact they are among the deepest in the world. Due to which meaning of this word that means gold is a very expensive process. Then comes the mineral salt. Which is obtained from seas lakes and rocks. India is one of the leading producers and exporters of salt. Gujarat tamil nadu and rajasthan are the leading states in salt production. If it talk about the uses of minerals then children. There would hardly be an industry where minerals are not used. Minerals are used for gems. Such minerals are usually hard. They are then set in different styles for jewellery. Copper is an indispensable metal in the electrical industry. Because it is widely used for making wires. Electric motors. Transformers and generators. Earlier it was used for making coins also. So we can see that copper is used in everything from coins to pipes. Silicon is another very important mineral which is used in computer industry and is obtained from. Quads. Then aluminium. Which is obtained from the from bauxite it is used to manufacture automobile automobiles automobiles. And aircraft. It is also used by industries which deal with construction furniture fittings and kitchenware at sector up. Minerals have and its uses. But we must remember that minerals are non renewable. Once exhausted day take a very long time. Seth thousands of years to develop and therefore they cannot be replenished immediately at the time of need. Because the rate of their formation is much much slower than the rate at which we consume these minerals. Therefore they have to be conserved and not be misused at all. It is necessary to reduce their wastage in the process of mining. Another way is the mineral in which the mineral resources can be conserved is. The recycling of. Metals. That's all for this video the rest part of the chapter will be covered in the next video. Till then try to solve the following questions. First mission. Describe briefly. Methods of extraction of minerals. Second question. Minerals occur in different types of rocks. Explain. Third question. Describe the mineral distribution in africa and australia. 4th question. Write the common uses of minerals. Why are minerals considered nonrenewable. Children. If you found this video helpful and wish to watch more of such content. Do consider subscribing to the channel. Also if you have any queries or comments. Please post them in the comments section below. Thank you.",
    "keywords": "minerals,iron,deposit,iron ore,ore,copper,mineral,india,rock,pradesh,manganese,gold,nickel,metallic,producers",
    "domain": "Geography",
    "title": "Minerals and Power Resources",
    "faculty": "Kalaam"
  },
  {
    "duration": "17:35 min",
    "video_url": "https://drive.google.com/file/d/1UiXKLiLnLRraBGAIrEjL0yXzOg5Nfs_G/preview?usp=share_link",
    "transcript": "Hello everyone. I am kiran joshi. Hope you all are safe and sound. Welcome to class 8 geography chapter 6. Human resources. We have learnt earlier that. The utility of an object makes it a resource and it is people only that turn these objects or substances into resources with their knowledge and skill. Does. People are the special resource. Latest human resources. Healthy educated and motivated people develop resources as per their need and contribute to the growth of a nation. Is the other resources are not equally distributed. You are the human resources to. They also differ in their educational level. Age and sex. Day number and composition also keep changing. This change is recorded through a process called sensor. In india the census is taken every 10 years. Now let us take a look at the distribution of population. Children. The way in which the population is distributed across the word is called the pattern of population distribution. And this distribution of population in the world is highly uneven. More than 90% of the world's population lives in about. 30% of land surface. It means. That there are regions in the world which are thickly populated because they have equable climate. The get adequate rainfall the land is flat and soil is fertile for example places like south and southeast asia europe and north eastern north america. However population is low in regions where the climate is inhospitable like the high altitude regions extremely cold regions. Cold regions and tropical deserts also and in the dense forest of equatorial regions. Another fact about the pattern of population distribution is that more people live in north of equator or in the northern hemisphere. Then in the. Southern hemisphere. Almost three by fourth population of the world is concentrated in only two continents asia and africa. Another factors that about 60% of the world's people live in just 10 countries. You can see here that these countries have more than 100 million people. One more fact is that more than one third of the world's population live in india and china. No let's learn about density of population. Children density of population is the number of people living per square unit of area or the earth. Earth surface usually it is expressed as per square kilometre. The density of population also varies over the surface of the earth the average population density of the entire word is 51 persons per square kilometre. South central asia has the highest density of population then there are regions of east asia and southeast asia which have higher density of population. India's population density as the as a whole is 382 people per square kilometre. Now let's understand the various factors. That are responsible for the uneven distribution of population. These factors can be can be broadly be classified into two groups. 1 geographical factors. Which include topography climate soil water mineral. And second social. Cultural and economic factors. If we talk about topography so plains have high density of population in comparison to mountains and plateaus. You noted that plains are suitable for farming for manufacturing and service activities. For example the indo-gangetic plains are among the most densely populated areas of the word whereas the himalayas the alps. The andes have low density of population. Then climate of a place also affects the population distribution. Areas with equable and moderate climate have high density of population while areas of extreme climate like sahara desert polar regions of russia canada and antarctica. Are preferred. Are not preferred by people for permanent settlements. Another geography geographical factor is soil. People prefer to live in places with fertile soil as they are suitable for agriculture. Therefore fertile plains like ganga and brahmaputra in india. When he. Change the young in china and the nile in egypt are densely populated. Then water is another very important factor affecting the population density. People always prefer to live in those regions where freshwater is easily available. For example the major river valleys of the world are densely populated wild deserts which are dry have. Parsley population. Sparsh population. Availability of mineral resources and other geographical factor that affect the population distribution like areas rich in mineral deposits. Tend to be more populated. Regions around diamond mines of south africa and areas rich in oil in the middle east are such examples. Other than geographical factors some social cultural and economic factors also play important role in affecting population density. Social factors include education health and housing facilities. Areas with better such facilities have dense population for example pune in india. If we say cultural factor then places having religious significance or cultural importance. Tend to be heavily populated. For example varanasi vatican city jerusalem. Then economic factors also affect significantly on the distribution of population. Places with industries that provide employment opportunities. And places that have good infrastructural facilities like efficient transport network and electricity attract more number of people to settle there. Osaka in japan and mumbai in india are examples of such areas. Now comes the topic population change. This refers to change in the number of people during a specific period of time. If you look closely to the given figure you will see that the world population has grown immensely over the years. The main reason of this population change is due to the difference in difference between the number of births and deaths. Param very long period till before 1800. The word population grew in a slow peace. Reason was many babies died soon after their birth because of less medical facilities. More about production of food was not sufficient to meet the food requirements of all people. Due to all these reasons total population growth was quite low. Then in the year 1804 w population was marked as 1 billion. Then after 155 years only in 1959 what population grew to 3 billion. Such rapid growth of population is called population explosion. Then in 1999 this 3 billion population doubled to 6 billion just within 40 years of a short span. This reason the reason was that due to improve food supplies and better medical facilities the number of deaths. Reduced. However the number of births continued to stay high. Here it is important to tell your children that the number of birds are measured using birthday. Children birth rate refers to number of live births. 1000 people. Similarly deaths are measured using death rate that is the number of deaths per thousand people. The difference between the birth rate and the death rate of a country is called the natural growth rate of population of that country. And the main reason of the increase in the world's population is the fast increase in natural growth rate. Here are the three images. 1 inch yellow second and pink and third in light blue that show the population change due to due to the difference between birth rate and death rate. The first image shows that when birth date is more than the death rate it results in population increase. The second image depends. If birth date and death rate are equal population remains. Study. And as it is clear from the third image. When birth date is less than the death rate the population decreases. Birth and death are the natural causes of population change. However population change also occurs due to migration. Migration refers to the movement of people in and out of an area. This movement can be within a country from one state to another or from one region to another. Aur between countries. Those who leave a country as shown here through a person in green. Are called emigrants. In those who arrive in a country is in the picture hear the person is in red. Are referred to as immigrants. Usa and australia have gained population because in migration or immigration. While students population has decreased due to out migration or immigration. Usually people migrate from one from underdeveloped countries to more developed countries to find. A better job opportunities. Similarly people move within the country from rural areas to urban areas to get employment education or health care facilities. The growth rate of population differ in various countries. While overall overall population of the world is growing. All the countries are not experiencing this growth. Let's tik tik sample of countries like. Kenya that have high population growth rates. Earlier it head birth rates and death rates. However now due to improvement in health care the death rates have decreased. But the birth dates are still high there for the rates of population growth. In such countries are very high. On the other hand. Some countries are experiencing slow rates of population growth. For example united kingdom where both death and birth rates are low resulting slow growth of population. Children many of us has a misconception that. Population always hampers the economic growth of the country. It's not always correct. For example both bangladesh in japan are densely populated countries. But in terms of economic growth japan is far ahead of bangladesh. So to study the role of people as a resource it is necessary to know. More about the composition of the population. Children composition of population or we can say structure of the population refers to the different characteristics of a population in terms of age sex literacy level health condition occupation and income level. It means with the help of the composition of population we get to know the number of males and females. The age group. They belong to. About their educational level. Their occupation. Their income level about their health status at 17. We can understand the population composition of a country with the help of a population pyramid. It is also known as age sex pyramid because it expresses two things simultaneously. 18 shows the total population divided into different age groups such as 529 years 10 to 14 years and so on. Second it shows the percentage of the total population subdivided into males and females in each of the age groups. The shape of the population pyramid of a country reveals to measure details of its people. Dear age group. And sex ratio that is number of females. Per 1000 males. The number of children below 15 years are shown at the bottom. The number of aged people above 65 years are shown at the top. These two age groups that is people below 15 years and people above 65 years are considered as dependents. On economic li. Active working population which was between 15 and 64 years of age. Here. This working population is shown between two blue lines. If a country has both high birth and death rate. Its population pyramid is broad at the base. Rapidly narrows at the top. The reason is despite of the birth of many children most of them die at their early age or infancy. If you become adults ever and even fewer reach to old age. The population pyramid shows here is shown here off kenya is one such example. In some countries like india death rates. Specially of infants are decreasing. The population pyramid is broad at the younger age group as more infant survive. And become adults. Is the population pyramid of india reflects here you can also notice that a large population is of young people which is the indication of active working population. Now let's focus at the population pyramid of japan. The pyramid is narrow at the base due to low birth rates. Is the death rates are also low in japan more number of people reach old age. Children. The future of any country depends on its. Skilled energetic and hopeful young people. And in india we have such a resource. This resource can be highly productive if more investment is done towards the health education and skill development of young people. And they are provided with more opportunities to explore. Now we have come to the end of the chapter. But wait. Some questions are there to check your learning. So the first question is. How to various geographical factors affect the population distribution. Second describe the social cultural and economic factors that affect the population distribution. Explain the factors that affect the population change in a region. Fourth. What is population pyramid. What is its significance. What information can it game. Children. If you found this video helpful and wish to watch more of such content. Do consider subscribing to the channel. If you have any queries or comments please post them in the comments section below thank you.",
    "keywords": "population,people,change,bln,birth,pyramid,population pyramid,population change,death,distribution,deaths,world population,age,death rate,country",
    "domain": "Geography",
    "title": "Human Resource",
    "faculty": "Chopra"
  },
  {
    "duration": "9:59 min",
    "video_url": "https://drive.google.com/file/d/1q-Dn8vhEIpiGuFIAMeQC6FYC7Nfa3GQ9/preview?usp=share_link",
    "transcript": "Hello everyone. I am kiran joshi. Hope you all are. Welcome you all in class 5 evs chapter the great indian desert. This chapter will try to understand the location of the great indian desert. I will learn about its physical features. Its climate. The importance of the great indian desert. But first of all let's understand what is a desert. Such a desert is an area of land that is very dry because it gets very low amount of rainfall or no rain at rainfall at all. And therefore it has almost no water. Trees or plants. In this chapter we are learning about the great indian desert which is also known as the thar desert that means great indian desert and thar deserts are the name of. Simplest. Let's understand the extent of the great indian desert on the thar desert. Such that it stretches from the gujarat plains in the south. Up to the borders of punjab and haryana in the north. As you can see in the given image also. It means the gujarat plains make the southern border of the thar desert. And in the north the southern boundaries of punjab and haryana border it. The aravali range which is the oldest mountain range in india marks the eastern border of the thar desert. This was about the location of the great indian desert. Now let's understand its features. The great indian desert or the thar desert is very large dry region of saint and rocks. This large region is small small hills of sand which are known as sand dunes. So pasand yun is a small amount or hill of saint which is formed by the wind. Set children. That this region is very dry. It is because it's receives very little. Or you can say low rainfall. The luni river is the only river in the desert. It is a seasonal river and does not have much water throughout the year. A very obvious question that comes in our mind is how did people travel. Through the this vast desert. Children in the olden days people used camel to travel across the desert. In fact you might be knowing that camel is called the ship of the desert. You know why. It is because of its physical advantages which help camel to move in the desert easily. For example it has long padded feet. That help it to take long strides on hot sand and water easily. Camel stores food in its hump and can travel without water for many days. Due to these reasons camel is truly the ship of the desert. Nowadays jeeps are also used in cities as means of transport. Now as we know that that. There is very little or no rainfall in the thar desert. This great scarcity or shortage of water. Due to this water shortage very few plants grow here. Which plants do not need much water. To survive in the desert such as cactus ki qubool it sector. The desert plants. Have some special features. For example they are generally thorny and have long and deep roots. The thorns help preventing loss of water and the deep roots help plants take water from surface ground level. Dude region is usually drive with no or very little vegetation. In some places children in the desert there are oasis to. Oasis is a place in the desert where water comes up to the surface from deep underground. The presence of water makes the surrounding area green and fertile. So much green and fertile place in the desert is called a an oasis. Is this oasis provide suitable conditions for human settlements venue villages are developed around them. Is the desert area has great shortage of water the government has tried to solve this problem and provide water to the people of desert by building a canal. Canal is a human made waterway or you can say an artificial water way. That is used for irrigation travel and the water for a canal usually comes from a connecting river lake or ocean. So here a canal is built called indira gandhi canal. Which is named after the first woman prime minister of india mrs indira gandhi. This canal gets water from the river sutlej and beas. This is the longest canal of india. The indira gandhi canal has provided water for irrigation facilities. For drinking and industrial use. This irrigation has resulted in the increase in agricultural production as well as the cultivated area. Does this canal has transformed a vast area of barren desert into fertile and good fields. In many crops such as jwar bajara mein barley. And even wheat are produced here. A large number of people in the desert are nomads. Nomads are people who move from place to place. The banjaras are the nomadic people in the thar desert. Their main occupation is cattle rearing. So dikki on moving from place to from one place to another for the availability of water and pasture for grazing their animals. These nomads are considered to be expert in making goods of iron. Some moments are salt traders fortune tellers jugglers acrobats. Snake charmers grindstone makers and basket makers also. Children the handicraft work and the tie and dye of rajasthan is very popular not only in india but also in abroad. And is a great source of earning as well. This is one of the many important aspects of the thar desert. Let's understand some more points of importance of the great indian desert. So the first point is the beauty of this region. The tourists from within the country as well as from abroad. Come and visit this place attracted by its beauty. The desert is also very famous for its lively festivals such as teej gangor pushkar fair at 17. People visit here to witness and enjoy this festival. This region is also known for its vibrant colourful traditional clothing and attractive native jewelries. Jaipur jaisalmer jodhpur bikaner and udaipur are important cities of the thar desert. 10 places of many historical and tourist sites. Therefore many tourists from india and abroad visit here. Not only this the region is also has also many wildlife sanctuaries such as ranthambore sariska bharatpur. Which provide shelter to many wild animals as well as birds such as tigers panthers deer it sector. These wildlife sanctuaries are also a great attraction for people to visit here. The region is also quite popular for the beautiful historic grand palaces and forts. Which was built by the rajput kings. Does rajasthan becomes one of the most popular tourist destination of india where. Both domestic and international tourists arrive. Now let's understand. The climate of this region. Saathiya children the climate of the great indian desert is extremely hot in the summer and extremely cold during the winter. It is because of the presence of sand. The send has the feature that it absorbs heat very fast so the days are very hot. And in the same way it cools down very fast. Tu. Making the nights very cold. And the amount of rainfall in this in the desert is generally quite low. So this was about the thar desert or the great indian desert. Hope you liked the video and found it useful. Don't forget to subscribe the channel. Thank you.",
    "keywords": "desert,water,rainfall,importance,little,indian,indian desert,beautiful,canal,sand,etc,desert area,desert area receive,area receive,area receive little",
    "domain": "Geography",
    "title": "Indian Desert",
    "faculty": "David"
  }
]