[
  {
    "duration": "7:07 min",
    "video_url": "https://drive.google.com/file/d/16rTb027NXFSmJ1xmbiA7-Ammn6kNSSiP/preview?usp=share_link",
    "transcript": "Hey guys welcome to eta technology. Manas navjot singh jadeja and we are back with the data mining. Tutorial series. And as you can see today we are going to discuss. Min max normalisation technique. Min max normalisation is part of data pre processing. With the normalisation technique and now the question arises before learning how to apply min max. I want to ask you guys like to understand why normalisation is required if you understand that the process of calculating normalisation. Wire technique would be much more easier. So many machine learning algorithms. Attempt to find trends in data by comparing features of data points. However there is an issue when the features are on drastically different scales. So let's understand what do you mean by the. Basically normalisation is a set of techniques we apply on the data. Especially when they are coming from different scales. Otherwise admin read into errors and decision making or inappropriate decisions because its not matching up in the scale. Example says some of the date of birth we have my b in mi. Some date of which might be there in km and units are different but the numbers are there i will try to compare female lead into inappropriate the season the law of the case is similar to this where normalisation is required to be scaled down to a in a smaller number a range where all the numbers can be incorporated and that is known as normalisation. Understand this weather simple example. Show the simple normalisation technique which will fit the data. A n a predefined boundary or to be more specific a predefined interval. So here we are talking about normalisation which refers to a scaling of data in numeric variable in the range of 0 to 1. And the formula is. Vedas on the data which we want to transform. Is equal to v minus. Vi - main. / max minus min. Into pneumax minus new man + newman. Ceo at the same mathematical formula maybe you don't understand it right away or remember this is an easier way to work it out with an example so let's see that. So let's learn it by a solved example which i'll be doing so here i have range of. A particular product and tuples. Write the increasing order. Supreme 13 272 as you can see a. Agar aditya which is 13 15 16 16 19 up to all the way to 72. Write an award to apply min max normalisation on the value what if i write. What is onto the range which is 02172 transform the whole set of numbers on the scale of 0 to 1 would i do that let us understand. So in order to do this we would require the question. The range of the numbers and also the number to be transformed. Going back to the formula what do we need we 10 is equal to b minus mean. Max minus man. Write into new max minus new men last human. So here we is the value which we want to transform. Write this particular value is the value which we want to transform in here equation it is modified. So we would be knowing that down plus we have a defined range so what we will be doing is. About the question what values we have. Baby listing out here are the given ranges 021. Date on which we want to transform v is equal to 45. Min value which we required here is 13. Wife will also require max which is. 72. New mal s0 and pneumax is 1. So when we gather all this data which is listed here. Into. The formula which is there above it will look something like this. We have the formula which is. V minus main sau vs 45 as we know. So what if i minus main with 13. So as you can see it here. It is 45 - 13. Maximum number in the range 72. So the denominator is 72 -. 13. Now new max new max is one as you can see it here. Right so 1 - 0 is one which is. In here. And you mean which is nothing but. Again. 0. Witches. Zero in here. So 45 - 13 by 72 - 13 into 1 + 0 it is nothing but this particular term. When we mathematically calculate this the result and value is. Zero point. 5423 on the scale range of 0 to 1. Show the new transform point of modify on the scale of 0 to 1 using the given set of value is point 54 23. Anasuya family latest new one more example so you guys can understand it well. So now we have the another set of values we still have the same in maths. Write all of the new values. To the new men and new max is. 0 and 1 the range of value here is. If you can see properly is 200 to 1000. Why so that is the set of values we have. So data with i'll be taking up too transformers 320 can see we have the given range which is. Let me show ada yeh the given ranges. Hero no 1. Data breach of chosen is from the range itself. 300. New. Main is hero old -200. Old max ace 1000. New max ace. 1. Right. Subah how we - ben 300 - 200. Divide by max is 1000 - main which is 200 that comes out 800. Into 1 + 0 to basically we get 100 800 is equal to 0.1 25. Why. And that's the answer for this particular staff. This is how we can get all different values of different ranges into the value of a particular inner transformation range. And this helps the data mining or decision making for machine learning algorithms to work with the data much better. So i hope you would understand this with the sample sounds which we are done. You can practice more and if you can give the feedback to us. Write thank you so much.",
    "keywords": "range,normalization,newman,min max,example,min,data-transform,min max normalization,max normalization,v-min,newman-newman,transform point,example min,example min max,pre define",
    "domain": "Mathematics",
    "title": "Min-Max Normalization",
    "faculty": "Kohli"
  },
  {
    "duration": "5:31 min",
    "video_url": "https://drive.google.com/file/d/1cM8fz-Bwt7XestSaVIzUxpkQevlT2Gz-/preview?usp=share_link",
    "transcript": "Good morning. Start the chapter metric. Genetic fields of numbers for function. And these numbers of functions are college elements or entries of a matrix which can be noted by capital letters a b c and d. Encircled the rows of a matrix and columns of a matrix. In our example c the first matrix is having. 23 rose and. Two columns. And the second matrix is having. Roshan three columns. Citizen hotel a rectangular arrangement of numbers for functions. Hindi film basa functions are called entries or elements of a matrix. Eating limited by using the capital letter. Lines of elements are called the rows and vertical lines of elements are called. Problems of. What is a message to serving ambrose and n columns. It is called the matrix of order in bi. Seat matrix of order mba. General form of a matrix is a 11 a 1219. A11 means that is the first row first column. A1 tumi first row second column. 19 means element of first row into column. 81. Elemental second roop festival of second row and column. 31 may. 32 second wala. A m manish into first column. N2 is a second volume means that is an element of the young through and into. Can element general element that is. Means that is an element in the i throw and get the value of a lies between 1 and m. Value of the lies between 1 and. The number of elements in a number in matrices in into n. Ladies for examination i am having three rows and columns then it will have. 300 26 elements. Discuss about different type of mattress. The first one is 1 km km means a matrix having only one column. Only elements. One column. Then romatic se mattresses having only one row. Square matrix. Soch number of rows and number of columns are equal. It is. M m and n are equal in a number for m is equal to n. What is the square metric. Charges for matrix of order them or other. Diagonal matrix a square matrix is a diagonal matrix. If all the elements in its new diagonal elements are 0. Diagonal elements means like in a square. Diagonal. Elements in the diagonal path that are the diagonal elements. And hindi. All the non diagonal elements are zero. Then. Diagrammatic that is elements will be there in only hindi diagonal all other elements will be. Scalar matrix. Diagonal matrix is a scalar matrix is diagonal of a square. Diagonal matrix means only the diagonal elements will be there and all the other elements will be zero in the scalar matrix means in that diagonal elements all the elements will be equal. Matric. Identity matrix me. What is the most important metric fear. This means it is a square matrix. Then ki style mein tric. It is a scalar matrix work in a scalar matrix if all the equal elements. Identity matrix. This is for your mattress whose diagonal elements are one and all the other elements is it is usually denoted by i. All the elements. Two matrices are said to be equal if they are of the same same order. Send bihari school is there of the same order. Element of a is equal to the corresponding element of p that is. First row first element is equal to first row first element of the other methods. Second row second element is equal to. Second second element of this mathematics.",
    "keywords": "elements,matrix,diagonal,matrix order,columns,diagonal elements,example,matrices,square,square matrix,men,elements zero,identity,identity matrix,denote",
    "domain": "Mathematics",
    "title": "Matrix",
    "faculty": "Kohli"
  }
]