[
  {
    "duration": "11:57 min",
    "video_url": "https://drive.google.com/file/d/1aCULSvbW_FLKDM05wQxrJe4PtMa3LOJL/preview?usp=share_link",
    "transcript": "Hello everyone this is bar no of ci si by unknown number 732. Today's my seminar topic is magnetism. It contains magnetism types of magnetism difference between dire para ferro antiferro. Paramagnetic materials. Mysterious origin of magnetic moment. What is magnetism it is nothing with the phenomenon of attraction between iron and steel nickel and cobalt and other materials. Magnetism is a force exerted by magnets when they attract or repel each other magnetism is caused by the motion of electric charges. Every substance is made up of tiny particles called atoms. Their movement generate an electric current and causes age electron to act like a microscopic magnet. Magnetization and demagnetization magnetization is nothing but conversion of non magnet to magnet. Nt magnetization is quite opposite of magnetisation which is conversion of magnets to non magnets. Different kinds of magnets therefore types of magnets. Natural and artificial temporary and permanent magnets. Natural magnet are nothing but which are available original in the universe like earth. Artificial magnets are prepared artificially by mind there are three types of artificial magnet by magnets disc shaped magnet. Horseshoe magnets. Temporary magnets are those which lose their magnetism property with external conditions. Permanent magnets are those which never lose magnetism properties for external conditions. Different properties of magnetism that different properties like dipole. Pole strength magnetic length magnetic moment magnetic flux magnetic flux density magnetic field magnetic constant and susceptibility. Magnetic dipole with two poles pole strength strength of each pole in a magnet magnetic length is nothing but the distance between the two poles in a bar magnet. Magnetic moment. Product of pole strength and magnetic length is a magnetic moment. Group of magnetic force lines that meeting from north to south pole is called magnetic flux. Magnetic flux density. Total magnetic flux passing through north to south pole of a bar magnet is called magnetic flux density. Magnetic field the region around the magnet until which its influence axis is called magnetic field. Magnetic constant is the ability of medium to permits magnetic flux lines. Types of magnetic constant its medium vacuum. Vacuum and relative. Susceptibility is the ratio of magnetisation and applied magnetic field is cal susceptibility. Differences between. There are different kinds of magnetic materials which are diamagnetic. Paramagnetic ferromagnetic and ferromagnetic materials paramagnetic materials. Diamagnetic materials are nothing but in which atomic dipoles absent. Why poles are aligned in opposite direction. Spontaneous magnetization is there is no spontaneous magnetization. No coupling is present magnetic nature is the week. Magnetic field nature is also weak. Magnetic flux is completely repaired susceptibility is negative and very small magnetization and physical 20 effect of temperature is in it is independent of temperature and independent of magnetic field examples of a conductor paramagnetic materials. Coming to paramagnetic materials. Atomic dipoles are present continuous miner ties asian there is no spontaneous magnetization no and even no exchange coupling. Magnetic nature is partially weak or partially strong magnetic field nature its even partially weak or partially storm. Magnetic flux its parcel a attracted susceptibility is positive and small. Magnetisation is slow. Effect of temperature here. She is the curie constant. Example of alkali and transition materials. Ferromagnetic materials. Here atomic dipoles are present. Magnetic nature is very strong magnetic nature is also very strong. Magnetic flux is very strong very strongly attractive. Susceptibility is positive and large. Magnetisation is high. Effect of temperature here c is curie constant is the curie temperature example iron steel nickel cobalt. Antiferromagnetic materials atomic dipoles are present there is no spontaneous magnetization knows no exchange coupling. Is it has strong magnetic nature and magnetic field nature it is very. Magnetic flux is very strongly attracted. Susceptibility is positive in small magnetisation is slow. Example of side lies. Paramagnetic materials here it amit ipods are present. There is no spontaneous magnetization or exchange of coupling. Here it has strong magnetic nature and magnetic field nature. Magnetic flux is strongly attracted susceptibility is positive and large. Magnetisation is. An example of this is sunrise. Hysteresis curve. It is a curve that shows the relationship between the magnetic flux density and magnetising field strength the curve is generated by measuring the magnetic flux coming out from the. Ferromagnetic substance while changing the external magnetising field. Here is a car. The magnetic flux density b is increase when the magnetic field strength is increased. Some 0 with the increasing magnetic field there is an increase in the value of magnetism and finally reaches point. Point a which is called saturation point where b is constant here a saturation point and 20 constant. With the decrease in the value of magnetic field there is decrease in the value of magnetism but at be. And h. Are equal to zero. Substance of material retain some amount of 90 cm is called retentivity or reschedule point. When there is a decrease in the magnetic field. Toward the negative sign magnetism also decreases. At point c the substance is completely demagnetized. The force required to remove the retentivity of the material is known as. Coercive force. In the opposite direction the cycle is continue or where the saturation point is the retentivity point and forces f. Get the forward and opposite direction crosses the cycle is complete and this cycle is called the hysteresis curve. Advantages of the system is cover. Small region of the hysteresis loop is. Indicator of loss of hysteresis. Hysteresis loop is proper. Provided. When is substance with the. Hysteresis loop provide a substance with the important importance of. Retentivity and coercivity therefore the way to select the write material to make permanent magnet. Is. Medsimplified. Heart of machines. President magnet magnetism can be calculated from the. Bh graph and. It is there for simple tissues material for electromagnet. Retentivity and coercivity retentivity the amount of magnetization present when the external magnetising field is remove. Is known as retentivity. It is a materials it is a materials ability to retain a certain amount of magnetic property by an external magnetizing field is removed. The value of b at point b in the. Hysteresis loop. Coercivity dam on top. Reverse negative head that is negative has external minor typing field required to completely d9 8a is a substance is known as a 50. Office absence. The value of b at point c in the hysteresis loop. What are the different here are the differences between soft and hard magnets. Soft magnets its. Status is area is no where ask for hard magnet its height. Magnetization is easier when i ask for hard magnet it's difficult. The magnetization is easy for software and its various difficult. Hard magnet retentivity is low for hearts of -1 iifa. Hard magnet it is also lo for minors and hai pahad magnet susceptibility is hypersoft - whereas loafer hard magnet. Relative permeability is hypothesis of -1 as loafer. Hard magnets applications are temporary magnets. Purpose of magnets and for hard magnetic permanent magnets. Where is domain theory of ferromagnetism the domain theory was proposed by proposed by wise in 1979. Ferromagnetic materials is divided into many regions each region is called mine size of each turbine is 10 power minus 6 and. Is domain has dipole magnetise in different directions. Ferromagnetic domain applications of magnetic field applications of very strong magnetic field was observed the diagram. Naples one moment is observed in the second one rotation is observed. Origin of magnetic moment every night i'm magnetized with three types of magnetic moments. Forces on orbit magnetic moment spin magnetic moment nuclear magnetic moment. Coming to orbit magnetic moment the orbital magnetic moment is. Norbert mina technoment is a measure of the strength of the magnetic field produced by the orbital angular momentum when you're not is equal to minus in ph by 4 p.m.. Spin magnetic moment is us which is equal to minus half inch by 45 mm. Nuclear magnetic moment is new and is equal to h by 45 and. Thank you this is my magnetism. Seminar thank you.",
    "keywords": "magnetic,magnets,magnetism,magnet,materials,flux,pole,magnetic field,magnetic moment,ferry,qdiagnetic,nature,dipole,hysteresis,magnetic flux",
    "domain": "physics",
    "title": "Physics - Magnetism",
    "faculty": "Singh"
  },
  {
    "duration": "9:53 min",
    "video_url": "https://drive.google.com/file/d/1u2dHvzNvAbwEQyRgWqg12CvlDcTqcZ9i/view?usp=share_link",
    "transcript": "Hello everyone myself amisha pandey student of shivaji science college amravati from bsc final year biotech. My seminar topic is raman spectroscopy. Contents are. Introduction principle instrumentation difference between raman versus our method. Types and application. When introduction. Raman spectroscopy was discovered by cv raman in 1928. It is a spectroscopic technique used to absorb vibrational rotational and other low frequency modes in a system. Raman spectroscopy is commonly used in the chemistry to provide a fingerprint by which molecules can we identify. When the radiation pass through the transparent medium the space is present status of fraction of been in all direction. Raman scattering result from the some type of. Quantities vibrational change associated with ir spectra. The difference in the wavelength in between the incident and scatter visible radiation corresponds to wavelength in mid hydrogen. Principal. When monochromatic radiation is incident upon a sample. Then this light will interact with the sample in some fashion. It may be reflect and absorb or scatter in some manner. It is a scattering of radiation that occurs which gives information about molecular structure. Raman is based on scattering. Scattering is defined as. The process in which electromagnetic radiation or particles are deflected or diffuse. Most of the radiation is elastically scattered. A small portion is inelastic scatter. Tamil ketta composed of stocks and enter stock version. The spectrum is measured with the laser line as a reference. Is the pics are measure has the ship from the laser length. The big position are determined by the vibrational energy is associated with bonds in a molecule. Of which the sample is composed. Because of this the spectrum end up looking very similar to an ir spectrum and it interpreted similarly. Polar points with high dipole moments the bands are in a raman spectrum. Are those that are due to the high polarizable bond purchase with pilot roles. When the immediate radiation is of the type. First stock scattering second and disturb scattering third ray scattering. It's the grammatical explanation of scattering. An instrumentation laser source sample cell. Wavelength selective radiation transducer and computer data system. First instrumentation. Instrumentation for modern raman spectroscopy consists of three components. Leather shoes sample illumination system two table spectrometer. Main source. The source in a modern spectrometry are nearly always lasers because their high intensity is necessary to produce the raman scattering of sufficient intensity to be measured with a reasonable single to noise ratio. Because the incense intensity of raman scattering arises as the fourth power of frequency had gone and krypton ion sources that emit in a blue and. Green reason of spectrum have. Have an advantage over the other sources. Some common laser sources for raman spectroscopy. Laser type and welding. Adg 948 8.0 or 5.4.5. Crypto 95 30.9 aur 64 7.1. Helium neon 632.8 785 aur 830. Antivirus. 1064. Then second sample illumination system. Liquid samples. A major advantage of sample handling in raman spectroscopy compared with infrared arises because water is a vikram a scatter but a strong absorb of infrared radiation. Does aqua solution can be studied by raman spectroscopy but. Not interested. This advantage is particularly important for biological and inorganic system and its studies dealing with water pollution problem. 2nd solid samples. Raman spectra of solid sample are of an aqua by filling a small cavity with the sample. After it has been ground to a fine border. Third gas sample. Gas are normally container glass to 122 cm in diameter. Gases can also be seen in a small capital it tubes. Then third raman spectrometers. Raman spectrometer square similar in design and use the some type of components as a classical ultraviolet-visible dispersing instruments. Most employed double grating system to minimise the radiation reaching the transducer. Now raman spectrometer being marketed as either fluid transfer instrument with cool germanium transducer or a multichannel instrument based upon charge coupled device. Then difference between raman and infrared. In raman it is due to the scattering of light by the vibrating molecules. In internet it it is result of absorption of light by vibrating molecules. In roman the vibration is raman active if it. Causes of change in polarizability in infrared vibration is are active if there is change in dipole moment. Hina aman not process of permanent dipole moment in infrared the vibration constant should have a change in a dipole moment to do the due to that vibration. Cinnamon water can be used as a solvent in infrared water cannot be used to to the intensive sop of fire. In a raman sample preparation is not very elaborate it can be in any state. In infrared sample preparation is elaborate gases sample can really be used. In a raman gives an indication of covalent character in the molecule. In infrared gives an indication of ionic character in the molecule. The last one is in infrared cost of instrumentation is very high. Uninor internet comparatively inexpensive. Then raman spectrum lot of single intensity versus roman shape. Raman shift in cm -1 equals to energy of photon in energy of photon out is diagrammatically explanation of raghuvanshi. Din different types of raman spectroscopy. There are four types. Resonance raman spectroscopy rs. Surface-enhanced raman spectroscopy scrs. Micro raman spectroscopy. And last nonlinear raman spectroscopic techniques. Then application. The roman technique is superior to infrared for spectroscopy investigation in organic system because aqua solution can be employed. Raman spectra of inorganic spaces. In addition the vibrational energies of metal ligand bond are generally in a range of. Hundred to 787 inside that is experimental difficult to study. These vibration are frequently raman active. Raman studies are potentially useful source of information composition structure and stability of coordination compounds. Din raman spectra of organic spaces. Raman spectra are similar to infrared spectra in that they have resolved that are useful for functional group detection and fingerprint region. That permit the identification of specific compounds. Raman spectra more information about certain types of organic compounds. Then do their infrared. Counterparts. Quantitative application. Raman spectra tend to be less kurta with pics than infrared spectra. Pick overlap in mixture is less likely and quantity two measurements are simpler. In addition raman sampling devices are not subject to attack by moisture and small amount of water in a sample do not interfere. The last one is biological application of raman spectroscopy. Raman spectroscopy has been applied widely for the study of biological system. Second the advantage of this technique include the small sample requirements the minimum sensitivity towards interference by water. The spectre details and the. Conformational and environmental sensitivity. Thank you.",
    "keywords": "roman,sample,spectroscopy,roman spectroscopy,scatter,infrared,spectra,source,radiation,ramon,instrumentation,roman scatter,water,study,roman spectra",
    "domain": "Physics",
    "title": "Physics - Raman Spectroscopy",
    "faculty": "David"
  }
]